%Моделирование функций принадлежности и дигностики болезней
%с использованием параметров функций GLCM 2метрики в виде коэффициента
%ковариации параметров эталонного оисания и модельных параметров
%Вычисляется процент правильных результатов диагностики
%при многократном повторении диагностики исходные значения модельных параметров
%задаются с различными случайными отклонениями от эталонных значений


clc;
clear;

m=1000;%количество статистических испытаний. 
k=3;%номер заболевания на входе
contr=8; % 12 контрольная точка для настройки программы
kb_in=2^k;%входной код заболевания (нужен для определения правильности диагностики)
S=0.12;% 0.12 СКО случайных отклонений от эталонных значений
BT=0.005;%коэффициент для порога бинаризации
x = 0:9;% 14 номера возможных болезней

%Подлинные результаты измерений параметров Contrast, Correlation,
%Energy,Homogenity для компонент R,G,B,RG,RB,GB (Считаем их эталонными описаниями для 15
%болезней). Вместо этого массива данных нужно
%использовать массив значений, усредненных по обучающей выборке
% Rcon = [0.2457 0.124 0.3154 0.2008 0.3102 0.2077 0.2023 0.1599 0.2013 0.2941 0.3151 0.1268 0.2207 0.33 0.34];
% Rcor = [0.9497 0.9439 0.8911 0.8028 0.8128 0.9657 0.937 0.9296 0.8735 0.8784 0.8542 0.9341 0.9049 0.8213 0.935];
% Ren = [0.1195 0.2224 0.1504 0.3312 0.1897 0.1092 0.2122 0.2347 0.2263 0.1417 0.1444 0.2764 0.1639 0.1693 0.1583];
% Rhom = [0.9005 0.9471 0.8596 0.925 0.8669 0.9064 0.9062 0.923 0.9024 0.8653 0.8514 0.938 0.8938 0.8495 0.9026];
% Gcon = [0.2055	0.1204	0.2809	0.2413	0.3021	0.1782	0.2229	0.1494	0.226	0.241	0.2542	0.1181	0.2591	0.367	0.1953];
% Gcor = [0.9126	0.9436	0.8666	0.7935	0.8201	0.9628	0.9378	0.9377	0.9062	0.862	0.8593	0.942	0.7696	0.8382	0.9441];
% Gen = [0.1816	0.2485	0.2108	0.2585	0.1797	0.132	0.1415	0.298	0.1651	0.1827	0.1731	0.3011	0.2667	0.1998	0.146];
% Ghom = [0.9154	0.9477	0.8758	0.9046	0.8637	0.9188	0.8949	0.9281	0.8911	0.885	0.8766	0.9424	0.8872	0.8706	0.9064];
% Bcon = [0.221	0.1095	0.3115	0.2527	0.313	0.1799	0.1791	0.1634	0.2008	0.2449	0.3155	0.0996	0.2928	0.408	0.1915];
% Bcor = [0.9418	0.9412	0.8015	0.7478	0.8167	0.96	0.8436	0.96	0.8756	0.8239	0.8599	0.9651	0.8327	0.7752	0.9501];
% Ben = [0.143	0.2467	0.2115	0.3014	0.1764	0.1765	0.36	0.3596	0.4416	0.2292	0.1689	0.5066	0.1982	0.2018	0.1538];
% Bhom = [0.9115	0.9553	0.8613	0.9102	0.8541	0.917	0.9133	0.9206	0.9023	0.8832	0.8515	0.9514	0.8715	0.8596	0.9075];
% RGcon = [0.0325	0.0272	0.0068	0.0716	0.2173	0.0436	0.0047	0.0353	0.022	0	0.2309	0.0141	0.1669	0	0.1915];
% RGcor = [0.9443	0.8913	0.7202	0.8351	0.7942	0.8913	0.7728	0.9363	0.901	0	0.6877	0.8054	0.7707	0	0.9501];
% RGen = [0.7012	0.7232	0.9689	0.5689	0.2338	0.6744	0.9748	0.4623	0.7886	1	0.3307	0.9136	0.3319	1	0.1538];
% RGhom = [0.9838	0.9864	0.9966	0.9642	0.8922	0.9782	0.9977	0.9823	0.989	1	0.8854	0.9929	0.9178	1	0.9075];
% RBcon = [0.1206	0.0796	0.0778	0.1414	0.4523	0.1227	0.0939	0.1122	0.1004	0.1579	0.4487	0.0494	0.2209	0.0353	0.0053];
% RBcor = [0.9804	0.9222	0.8669	0.9139	0.7994	0.954	0.9383	0.9468	0.9186	0.8088	0.8683	0.9505	0.8746	0.8215	0.7371];
% RBen = [0.2187	0.3535	0.5046	0.2234	0.1276	0.2023	0.3236	0.2454	0.313	0.3227	0.0914	0.3914	0.2045	0.8055	0.9747];
% RBhom = [0.9401	0.9602	0.9611	0.9305	0.8144	0.9388	0.9532	0.9439	0.9532	0.9212	0.7974	0.9753	0.8919	0.9823	0.9974];
% GBcon = [0.1205	0.0626	0.0764	0.0842	0.3176	0.0818	0.1041	0.1037	0.1425	0.1464	0.1746	0.0578	0.1258	0.0385	0.0535];
% GBcor = [0.964	0.9218	0.8665	0.8384	0.7138	0.9187	0.9267	0.9192	0.9289	0.7705	0.794	0.9458	0.812	0.7731	0.8965];
% GBen = [0.1983	0.3974	0.4506	0.4231	0.2515	0.3384	0.2669	0.3425	0.2186	0.4016	0.3142	0.3648	0.4018	0.8044	0.4677];
% GBhom = [0.94	0.9687	0.9618	0.9583	0.8518	0.9591	0.9484	0.9482	0.9343	0.9269	0.9127	0.9711	0.9371	0.9807	0.9733];

%Эталонные описания. Вариант2
% Rcon=[0.2952	0.1468	0.6683	0.2377	0.7554	0.2935	0.4243	0.2211	0.5882	0.3389	0.4601	0.1577	0.4222	0.5914	0.2519];
% Rcor=[0.9322	0.9227	0.762	0.7828	0.6414	0.9459	0.8763	0.882	0.658	0.8578	0.7947	0.8512	0.8047	0.777	0.8934];
% Ren=[0.1201	0.2185	0.1046	0.2853	0.1253	0.0965	0.1429	0.207	0.1231	0.1309	0.1165	0.2965	0.1339	0.1363	0.1656];
% Rhom=[0.8786	0.9272	0.7635	0.9047	0.7665	0.8695	0.8192	0.8926	0.7616	0.8437	0.7979	0.9212	0.8208	0.8048	0.8793];
% Gcon=[0.2641	0.1409	0.6492	0.2764	0.7484	0.2625	0.4357	0.2054	0.6061	0.3082	0.4183	0.1592	0.4813	0.5143	0.2412];
% Gcor=[0.862	0.9186	0.6842	0.7669	0.6466	0.9305	0.8573	0.8809	0.7658	0.8277	0.774	0.8577	0.699	0.7629	0.9168];
% Gen=[0.1886	0.2593	0.1385	0.2385	0.1117	0.123	0.1076	0.2749	0.0973	0.1604	0.1357	0.3021	0.1987	0.1719	0.1433];
% Ghom=[0.89	0.93	0.7715	0.8864	0.7601	0.8805	0.8136	0.9008	0.759	0.8543	0.8146	0.9206	0.8162	0.8277	0.8847];
% Bcon=[0.2647	0.1326	0.6532	0.2651	0.6756	0.2662	0.4168	0.2241	0.5705	0.2977	0.4796	0.1285	0.5006	0.5422	0.2485];
% Bcor=[0.9189	0.9185	0.6187	0.7008	0.6134	0.907	0.6859	0.8789	0.3845	0.8024	0.7617	0.7951	0.7689	0.6947	0.9051];
% Ben=[0.1458	0.2349	0.1393	0.2939	0.122	0.1864	0.2175	0.3354	0.2052	0.2006	0.1355	0.5361	0.1307	0.1677	0.1589];
% Bhom=[0.8895	0.9342	0.7661	0.8982	0.7608	0.8782	0.8195	0.8893	0.7641	0.8595	0.792	0.9359	0.8077	0.8166	0.8804];
% RGcon=[0.0309	0.0252	0.0061	0.0704	0.1667	0.0501	0.0054	0.0368	0.023	0.0003	0.2192	0.0133	0.152	0	0.0015];
% RGcor=[0.9468	0.9007	0.7206	0.8331	0.8098	0.8924	0.769	0.9329	0.902	-0.0001	0.6811	0.7481	0.7469	0	0.3993];
% RGen=[0.7041	0.7221	0.9719	0.5671	0.2946	0.6123	0.9714	0.4589	0.7769	0.9994	0.3123	0.9341	0.3884	1	0.996];
% RGhom=[0.9845	0.9874	0.9969	0.9648	0.9167	0.975	0.9973	0.9816	0.9885	0.9999	0.8904	0.9934	0.924	1	0.9993];
% RBcon=[0.1108	0.0758	0.075	0.1239	0.2903	0.1188	0.0768	0.1093	0.0824	0.1229	0.3924	0.0394	0.1991	0.0424	0.0463];
% RBcor=[0.9777	0.9192	0.8549	0.9197	0.8319	0.9569	0.9565	0.9304	0.9073	0.8059	0.8522	0.9309	0.8381	0.8257	0.8237];
% RBen=[0.212	0.3658	0.5378	0.2389	0.1794	0.1868	0.3135	0.2661	0.3504	0.4236	0.1098	0.4717	0.2699	0.7587	0.6944];
% RBhom=[0.9449	0.9621	0.9625	0.9381	0.8646	0.9406	0.9616	0.9454	0.9588	0.9386	0.812	0.9803	0.9007	0.9788	0.9769];
% GBcon=[0.1058	0.0576	0.0735	0.075	0.233	0.0788	0.0847	0.0998	0.1203	0.1096	0.1612	0.0606	0.1135	0.0223	0.06];
% GBcor=[0.9554	0.9169	0.8509	0.853	0.7588	0.9181	0.929	0.8908	0.9252	0.7635	0.7715	0.9252	0.8079	0.7192	0.8603];
% GBen=[0.2263	0.4219	0.4966	0.4304	0.3154	0.3529	0.3109	0.3953	0.2428	0.5007	0.3678	0.3834	0.4565	0.8994	0.532];
% GBhom=[0.9472	0.9712	0.9633	0.9625	0.8867	0.9606	0.9577	0.9501	0.9398	0.9452	0.9194	0.9697	0.9432	0.9888	0.97];

Rcon=[0.02616544 0.02076346 0.01891345 0.01293092 0.00158586 0.0136622 0.01109162 0.03360171 0.01955753 0.01964747];
Rcor=[0.969540513 0.983309773 0.98713835 0.995364989 0.9984895 0.984528183 0.993144632 0.979269059 0.988745078 0.987222809];
Ren=[0.31365 0.388189 0.302547 0.309425 0.454884 0.330704 0.340586 0.348831 0.298716 0.298622];
Rhom=[0.987002789 0.989897485 0.990964883 0.993816425 0.999207 0.993437337 0.99446 0.983946441 0.991050188 0.99023933];

Gcon=[0.025403409 0.02026456 0.018201959 0.012143102 0.001387204 0.013404094 0.010705304 0.033856189 0.019409373 0.017304984];
Gcor=[0.967472487 0.986193848 0.977504142 0.99398692 0.9981427 0.980971154 0.994457579 0.962685441 0.987957625 0.984242628];
Gen=[0.341363868 0.402845394 0.315640318 0.342476425 0.4832172 0.363132115 0.362166947 0.398207412 0.321037641 0.312195362];
Ghom=[0.987390105 0.990206924 0.991285642 0.994178655 0.9993064 0.993526577 0.994654474 0.983818706 0.991027734 0.991408628];

Bcon=[0.024644902 0.021583351 0.021160898 0.012183788 0.001208753 0.014145244 0.009555209 0.028872037 0.018565941 0.017355645];
Bcor=[0.965400776 0.975215773 0.99512345 0.993453759 0.9978183 0.981792433 0.9665045 0.950250559 0.984654797 0.986945936];
Ben=[0.381273145 0.455111682 0.29545909 0.400498379 0.6347925 0.379215471 0.395108947 0.486090735 0.380115938 0.349736138];
Bhom=[0.987778079 0.989490636 0.990311742 0.994251598 0.9993955 0.993129712 0.995229526 0.986102765 0.991225125 0.991399011];

RGcon=[0.017355377 0.014024479 0.012675268 0.008534076 0.000952861 0.00929774 0.007310825 0.024551377 0.013537233 0.012136863];
RGcor=[0.961383579 0.98027997 0.975871483 0.992556563 0.9980198 0.979581808 0.992540026 0.958733059 0.985076844 0.979984351];
RGen=[0.465347342 0.482393045 0.3845078 0.444047471 0.5987774 0.46140524 0.403811368 0.509937118 0.400134969 0.401291926];
RGhom=[0.991340026 0.993023909 0.993702667 0.995808276 0.9995236 0.995397433 0.996344526 0.987954618 0.993472141 0.993933957];

RBcon=[0.008315167 0.008227486 0.007752846 0.004358491 0.000643097 0.006224515 0.003270419 0.007254901 0.005820369 0.006419472];
RBcor=[0.925527447 0.951761864 0.982390967 0.899605897 0.8972407 0.93835399 0.935083263 0.9157215 0.93291275 0.955983543];
RBen=[0.690971789 0.652203136 0.501021775 0.613354299 0.7904272 0.608335519 0.639500105 0.745008029 0.621837828 0.593316819];
RBhom=[0.995842434 0.995887333 0.996125267 0.997825414 0.9996784 0.996887731 0.998364789 0.9963805 0.997091344 0.996790213];

GBcon=[0.021843614 0.019812005 0.016465553 0.010173919 0.001016834 0.011757515 0.008544226 0.028037244 0.016038166 0.015708908];
GBcor=[0.964913974 0.978987318 0.985639125 0.993098851 0.9979947 0.980424202 0.966998 0.926810029 0.985678563 0.983384723];
GBen=[0.400072421 0.43635597 0.329807621 0.405074529 0.6459244 0.402178077 0.400929289 0.475342029 0.371010734 0.346517351];
GBhom=[0.989125566 0.990225833 0.991989133 0.995091747 0.9994916 0.994247808 0.995730184 0.986423324 0.992429609 0.992183734];

result=0;
global_result=0;
for j1=1:m %цикл статистических испытаний
    noise=randn(1,24);    
for j=1:10 % 15 вычисление вектора-строки средних значений по столбцам матрицы эталонного описания      
    S1(j)=(Rcon(j)+Rcor(j)+Ren(j)+Rhom(j)+Gcon(j)+Gcor(j)+Gen(j)+Ghom(j)+Bcon(j)+Bcor(j)+Ben(j)+Bhom(j));
    S2(j)=(RGcon(j)+RGcor(j)+RGen(j)+RBhom(j)+RBcon(j)+RBcor(j)+RBen(j)+RBhom(j)+GBcon(j)+GBcor(j)+GBen(j)+GBhom(j));
    SJ(j)=(S1(j)+S2(j))/24;   
end; 
SJ_contr=SJ(contr);
for j=1:10 % 15 вычисление матрицы параметров, полученных при моделирования результатов измерений
   XRcon(j)=Rcon(j)+S*noise(1);XRcor(j)=Rcor(j)+S*noise(2);XRen(j)=Ren(j)+S*noise(3);XRhom(j)=Rhom(j)+S*noise(4);
   XGcon(j)=Gcon(j)+S*noise(5);XGcor(j)=Gcor(j)+S*noise(6);XGen(j)=Gen(j)+S*noise(7);XGhom(j)=Ghom(j)+S*noise(8); 
   XBcon(j)=Bcon(j)+S*noise(9);XBcor(j)=Bcor(j)+S*noise(10);XBen(j)=Ben(j)+S*noise(11);XBhom(j)=Bhom(j)+S*noise(12); 
   XRGcon(j)=RGcon(j)+S*noise(13);XRGcor(j)=RGcor(j)+S*noise(14);XRGen(j)=RGen(j)+S*noise(15);XRGhom(j)=RGhom(j)+S*noise(16);
   XRBcon(j)=RBcon(j)+S*noise(17);XRBcor(j)=RBcor(j)+S*noise(18);XRBen(j)=RBen(j)+S*noise(19);XRBhom(j)=RBhom(j)+S*noise(20);
   XGBcon(j)=GBcon(j)+S*noise(21);XGBcor(j)=GBcor(j)+S*noise(22);XGBen(j)=GBen(j)+S*noise(23);XGBhom(j)=GBhom(j)+S*noise(24);   
end  
for j=1:10 % 15 вычисление вектора-строки средних значений по столбцам матрицы результатов измерений      
    XS1(j)=(XRcon(j)+XRcor(j)+XRen(j)+XRhom(j)+XGcon(j)+XGcor(j)+XGen(j)+XGhom(j)+XBcon(j)+XBcor(j)+XBen(j)+XBhom(j));
    XS2(j)=(XRGcon(j)+XRGcor(j)+XRGen(j)+XRGhom(j)+XRBcon(j)+XRBcor(j)+XRBen(j)+XRBhom(j)+XGBcon(j)+XGBcor(j)+XGBen(j)+XGBhom(j));
    XSJ(j)=(XS1(j)+XS2(j))/24 ;  
end; 
SJ_contr=SJ(k);
XSJ_k=XSJ(contr);
       for j=1:10 % 15
          x_sko(j)=0;
          y_sko(j)=0;
       end    
 for j=1:10 % 15 вектор-строка СКО по столбцам 
    x_sko1(j)= (Rcon(j)-SJ(j))*(Rcon(j)-SJ(j))+(Rcor(j)-SJ(j))*(Rcor(j)-SJ(j))+(Ren(j)-SJ(j))*(Ren(j)-SJ(j))+(Rhom(j)-SJ(j))*(Rhom(j)-SJ(j));
    x_sko2(j)= (Gcon(j)-SJ(j))*(Gcon(j)-SJ(j))+(Gcor(j)-SJ(j))*(Gcor(j)-SJ(j))+(Gen(j)-SJ(j))*(Gen(j)-SJ(j))+(Ghom(j)-SJ(j))*(Ghom(j)-SJ(j));
    x_sko3(j)= (Bcon(j)-SJ(j))*(Bcon(j)-SJ(j))+(Bcor(j)-SJ(j))*(Bcor(j)-SJ(j))+(Ben(j)-SJ(j))*(Ben(j)-SJ(j))+(Bhom(j)-SJ(j))*(Bhom(j)-SJ(j));
    x_sko4(j)= (RGcon(j)-SJ(j))*(RGcon(j)-SJ(j))+(RGcor(j)-SJ(j))*(RGcor(j)-SJ(j))+(RGen(j)-SJ(j))*(RGen(j)-SJ(j))+(RGhom(j)-SJ(j))*(RGhom(j)-SJ(j));
    x_sko5(j)= (RBcon(j)-SJ(j))*(RBcon(j)-SJ(j))+(RBcor(j)-SJ(j))*(RBcor(j)-SJ(j))+(RBen(j)-SJ(j))*(RBen(j)-SJ(j))+(RBhom(j)-SJ(j))*(RBhom(j)-SJ(j));   
    x_sko6(j)=(GBcon(j)-SJ(j))*(GBcon(j)-SJ(j))+(GBcor(j)-SJ(j))*(GBcor(j)-SJ(j))+(GBen(j)-SJ(j))*(GBen(j)-SJ(j))+(GBhom(j)-SJ(j))*(GBhom(j)-SJ(j));     
     x_sko(j)=x_sko1(j)+x_sko2(j)+x_sko3(j)+x_sko4(j)+x_sko5(j)+x_sko6(j);
    y_sko1(j)=(XRcon(j)-XSJ(j))*(XRcon(j)-XSJ(j))+(XRcor(j)-XSJ(j))*(XRcor(j)-XSJ(j))+(XRen(j)-XSJ(j))*(XRen(j)-XSJ(j))+(XRhom(j)-XSJ(j))*(XRhom(j)-XSJ(j));
    y_sko2(j)=(XGcon(j)-XSJ(j))*(XGcon(j)-XSJ(j))+(XGcor(j)-XSJ(j))*(XGcor(j)-XSJ(j))+(XGen(j)-XSJ(j))*(XGen(j)-XSJ(j))+(XGhom(j)-XSJ(j))*(XGhom(j)-XSJ(j));
    y_sko3(j)=(XBcon(j)-XSJ(j))*(XBcon(j)-XSJ(j))+(XBcor(j)-XSJ(j))*(XBcor(j)-XSJ(j))+(XBen(j)-XSJ(j))*(XBen(j)-XSJ(j))+(XBhom(j)-XSJ(j))*(XBhom(j)-XSJ(j));
    y_sko4(j)=(XRGcon(j)-XSJ(j))*(XRGcon(j)-XSJ(j))+(XRGcor(j)-XSJ(j))*(XRGcor(j)-XSJ(j))+(XRGen(j)-XSJ(j))*(XRGen(j)-XSJ(j))+(XRGhom(j)-XSJ(j))*(XRGhom(j)-XSJ(j));
    y_sko5(j)=(XRBcon(j)-XSJ(j))*(XRBcon(j)-XSJ(j))+(XRBcor(j)-XSJ(j))*(XRBcor(j)-XSJ(j))+(XRBen(j)-XSJ(j))*(XRBen(j)-XSJ(j))+(XRBhom(j)-XSJ(j))*(XRBhom(j)-XSJ(j));
    y_sko6(j)=(XGBcon(j)-XSJ(j))*(XGBcon(j)-XSJ(j))+(XGBcor(j)-XSJ(j))*(XGBcor(j)-XSJ(j))+(XGBen(j)-XSJ(j))*(XGBen(j)-XSJ(j))+(XGBhom(j)-XSJ(j))*(XGBhom(j)-XSJ(j));
    y_sko(j)= y_sko1(j)+y_sko2(j)+y_sko3(j)+y_sko4(j)+y_sko5(j)+y_sko6(j);
 end  
 x_sko_contr= x_sko(contr);
 y_sko_contr= y_sko(k);
 z_sko_contr=sqrt(x_sko(contr)*y_sko(k));%%%%%%%%%%!!!!!!!!
 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Вычисление вектора-столбца коэффициента ковариации выбранного вектора-столбца
%результатов измерений  с вектором-столбцом матрицы эталонного описания
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for j=1:10
Rcon_fp(j)=(Rcon(j)-SJ(j))*(XRcon(k)-XSJ(k));%функция принадлежности 1
Rcor_fp(j)=(Rcor(j)-SJ(j))*(XRcor(k)-XSJ(k));%функция принадлежности 2
Ren_fp(j)=(Ren(j)-SJ(j))*(XRen(k)-XSJ(k));%функция принадлежности 3
Rhom_fp(j)=(Rhom(j)-SJ(j))*(XRhom(k)-XSJ(k));%функция принадлежности 4
 SumR(j)=Rcon_fp(j)+Rcor_fp(j)+Ren_fp(j)+Rhom_fp(j);%коэф. ковариации по R
end 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%GGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for j=1:10 % 15
Gcon_fp(j)=(Gcon(j)-SJ(j))*(XGcon(k)-XSJ(k));%функция принадлежности 1
Gcor_fp(j)=(Gcor(j)-SJ(j))*(XGcor(k)-XSJ(k));%функция принадлежности 2
Gen_fp(j)=(Gen(j)-SJ(j))*(XGen(k)-XSJ(k));%функция принадлежности 3
Ghom_fp(j)=(Ghom(j)-SJ(j))*(XGhom(k)-XSJ(k));%функция принадлежности 4
    SumG(j)=Gcon_fp(j)+Gcor_fp(j)+Gen_fp(j)+Ghom_fp(j);%коэф. ковариации по G
end 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for j=1:10
Bcon_fp(j)=(Bcon(j)-SJ(j))*(XBcon(k)-XSJ(k));%функция принадлежности 1
Bcor_fp(j)=(Bcor(j)-SJ(j))*(XBcor(k)-XSJ(k));%функция принадлежности 2
Ben_fp(j)=(Ben(j)-SJ(j))*(XBen(k)-XSJ(k));%функция принадлежности 3
Bhom_fp(j)=(Bhom(j)-SJ(j))*(XBhom(k)-XSJ(k));%функция принадлежности 4
    SumB(j)=Bcon_fp(j)+Bcor_fp(j)+Ben_fp(j)+Bhom_fp(j);%коэф. ковариации по B
end 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%RG RG RG RG RG RG RG RG RG RG RG RG RG RG RG RG RG RG RG  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for j=1:10
RGcon_fp(j)=(RGcon(j)-SJ(j))*(XRGcon(k)-XSJ(k));%функция принадлежности 1
RGcor_fp(j)=(RGcor(j)-SJ(j))*(XRGcor(k)-XSJ(k));%функция принадлежности 2
RGen_fp(j)=(RGen(j)-SJ(j))*(XRGen(k)-XSJ(k));%функция принадлежности 3
RGhom_fp(j)=(RGhom(j)-SJ(j))*(XRGhom(k)-XSJ(k));%функция принадлежности 4
    SumRG(j)=RGcon_fp(j)+RGcor_fp(j)+RGen_fp(j)+RGhom_fp(j);%коэф. ковариации по RG
end 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%RB RB RB RB RB RB RB RB RB RB RB RB RB RB RB RB RB RB RB  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for j=1:10
RBcon_fp(j)=(RBcon(j)-SJ(j))*(XRBcon(k)-XSJ(k));%функция принадлежности 1
RBcor_fp(j)=(RBcor(j)-SJ(j))*(XRBcor(k)-XSJ(k));%функция принадлежности 2
RBen_fp(j)=(RBen(j)-SJ(j))*(XRBen(k)-XSJ(k));%функция принадлежности 3
RBhom_fp(j)=(RBhom(j)-SJ(j))*(XRBhom(k)-XSJ(k));%функция принадлежности 4   
    SumRB(j)=RBcon_fp(j)+RBcor_fp(j)+RBen_fp(j)+RBhom_fp(j);%коэф. ковариации по RB
end 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB GB 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for j=1:10  
GBcon_fp(j)=(GBcon(j)-SJ(j))*(XGBcon(k)-XSJ(k));%функция принадлежности 1
GBcor_fp(j)=(GBcor(j)-SJ(j))*(XGBcor(k)-XSJ(k));%функция принадлежности 2
GBen_fp(j)=(GBen(j)-SJ(j))*(XGBen(k)-XSJ(k));%функция принадлежности 3
GBhom_fp(j)=(GBhom(j)-SJ(j))*(XGBhom(k)-XSJ(k));%функция принадлежности 4  
    SumGB(j)=GBcon_fp(j)+GBcor_fp(j)+GBen_fp(j)+GBhom_fp(j);%коэф. ковариации по GB
end 
for j=1:10
Sum(j)=SumR(j)+SumG(j)+SumB(j)+SumRG(j)+SumRB(j)+SumGB(j);
Sum1global(j)=Sum(j)/(sqrt(x_sko(j)*y_sko(k)));
end
% if ((Sum1(j)>(1+BT)))  
%     Sum1(j)=0;
% else
% if ((Sum1(j)<(1-BT)))      
%      Sum1(j)=0; 
% end     
% end
%end
% SumMax=max(Sum(j));
% Sum_contr=Sum(contr)
% Sum1_contr=Sum1(contr)

% j=1:15; %функция принадлежности 
% figure
% plot(j,Sum1global(j));
% title('Sum1global');
  Sum1globalmax=max(Sum1global);
for i=1:10
    Voting_global(i)=0;
    if (Sum1global(i)==max(Sum1global));   
        Voting_global(i)=1;
    end    
end
% %end
 VotingGlobalRes=Voting_global;%%%
kb_=0;
for i=1:10
    if (Voting_global(i)==1) 
       kb_= kb_+2^i ;
    end
end  
kb_in=kb_in;
kb_out=kb_ ;
if (kb_in==kb_out)   
  global_result=global_result+1;
end  
 end
GR=global_result;
GR_persent=GR/m*100 

%pause;
close all;
clear;